#### Terraform Plan Stage 📖`success`
<details><summary>Show Plan</summary>

```

terraform
azurerm_resource_group.example: Refreshing state... [id=/subscriptions/84ae9c2f-641a-4995-879c-668f773ec237/resourceGroups/jschmitter-gha-example-stage-wus2-rg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_app_service_plan.consumption will be created
  + resource "azurerm_app_service_plan" "consumption" {
      + id                           = (known after apply)
      + kind                         = "FunctionApp"
      + location                     = "westus2"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "jschmitter-gha-example-functions-stage-wus2-asp"
      + resource_group_name          = "jschmitter-gha-example-stage-wus2-rg"
      + tags                         = (known after apply)

      + sku {
          + capacity = (known after apply)
          + size     = "Y1"
          + tier     = "Dynamic"
        }
    }

  # azurerm_function_app.gha will be created
  + resource "azurerm_function_app" "gha" {
      + app_service_plan_id            = (known after apply)
      + app_settings                   = (known after apply)
      + client_affinity_enabled        = (known after apply)
      + custom_domain_verification_id  = (known after apply)
      + default_hostname               = (known after apply)
      + enable_builtin_logging         = true
      + enabled                        = true
      + https_only                     = false
      + id                             = (known after apply)
      + kind                           = (known after apply)
      + location                       = "westus2"
      + name                           = "jschmitter-gha-example-stage-wus2-func"
      + outbound_ip_addresses          = (known after apply)
      + possible_outbound_ip_addresses = (known after apply)
      + resource_group_name            = "jschmitter-gha-example-stage-wus2-rg"
      + site_credential                = (known after apply)
      + storage_account_access_key     = (sensitive value)
      + storage_account_name           = "jschmghaexampleswus2sa"
      + storage_connection_string      = (sensitive value)
      + tags                           = (known after apply)
      + version                        = "~1"

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                        = (known after apply)
          + app_scale_limit                  = (known after apply)
          + auto_swap_slot_name              = (known after apply)
          + dotnet_framework_version         = (known after apply)
          + elastic_instance_minimum         = (known after apply)
          + ftps_state                       = (known after apply)
          + health_check_path                = (known after apply)
          + http2_enabled                    = (known after apply)
          + ip_restriction                   = (known after apply)
          + java_version                     = (known after apply)
          + linux_fx_version                 = (known after apply)
          + min_tls_version                  = (known after apply)
          + pre_warmed_instance_count        = (known after apply)
          + runtime_scale_monitoring_enabled = (known after apply)
          + scm_ip_restriction               = (known after apply)
          + scm_type                         = (known after apply)
          + scm_use_main_ip_restriction      = (known after apply)
          + use_32_bit_worker_process        = (known after apply)
          + websockets_enabled               = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = (known after apply)
          + manual_integration = (known after apply)
          + repo_url           = (known after apply)
          + rollback_enabled   = (known after apply)
          + use_mercurial      = (known after apply)
        }
    }

  # azurerm_key_vault.gha will be created
  + resource "azurerm_key_vault" "gha" {
      + access_policy              = (known after apply)
      + id                         = (known after apply)
      + location                   = "westus2"
      + name                       = "jschmghaexampleswus2kv"
      + resource_group_name        = "jschmitter-gha-example-stage-wus2-rg"
      + sku_name                   = "standard"
      + soft_delete_enabled        = (known after apply)
      + soft_delete_retention_days = 7
      + tags                       = (known after apply)
      + tenant_id                  = "5ceca96d-5895-4b57-8130-1460fc5ec969"
      + vault_uri                  = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_key_vault_access_policy.gha_func_app will be created
  + resource "azurerm_key_vault_access_policy" "gha_func_app" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
        ]
      + tenant_id          = "5ceca96d-5895-4b57-8130-1460fc5ec969"
    }

  # azurerm_key_vault_access_policy.gha_runner will be created
  + resource "azurerm_key_vault_access_policy" "gha_runner" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = "6b30942b-f705-4653-85c2-b15e8361fd3d"
      + secret_permissions = [
          + "Get",
          + "Set",
          + "Delete",
          + "Purge",
          + "Recover",
        ]
      + tenant_id          = "5ceca96d-5895-4b57-8130-1460fc5ec969"
    }

  # azurerm_key_vault_access_policy.josh_schmitter_user will be created
  + resource "azurerm_key_vault_access_policy" "josh_schmitter_user" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = "0fb015b7-0535-4372-95bc-f6d68d4798f2"
      + secret_permissions = [
          + "List",
          + "Get",
          + "Set",
          + "Delete",
          + "Purge",
          + "Recover",
        ]
      + tenant_id          = "5ceca96d-5895-4b57-8130-1460fc5ec969"
    }

  # azurerm_key_vault_secret.stor_acct_key will be created
  + resource "azurerm_key_vault_secret" "stor_acct_key" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "StorageAccountKey"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_resource_group.example will be destroyed
  - resource "azurerm_resource_group" "example" {
      - id       = "/subscriptions/84ae9c2f-641a-4995-879c-668f773ec237/resourceGroups/jschmitter-gha-example-stage-wus2-rg" -> null
      - location = "westus2" -> null
      - name     = "jschmitter-gha-example-stage-wus2-rg" -> null
      - tags     = {
          - "created_on" = "2021-09-21T04:18:55Z"
          - "env"        = "stage"
        } -> null
    }

  # azurerm_resource_group.gha will be created
  + resource "azurerm_resource_group" "gha" {
      + id       = (known after apply)
      + location = "westus2"
      + name     = "jschmitter-gha-example-stage-wus2-rg"
      + tags     = (known after apply)
    }

  # azurerm_storage_account.gha will be created
  + resource "azurerm_storage_account" "gha" {
      + access_tier                      = (known after apply)
      + account_kind                     = "StorageV2"
      + account_replication_type         = "LRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + large_file_share_enabled         = (known after apply)
      + location                         = "westus2"
      + min_tls_version                  = "TLS1_0"
      + name                             = "jschmghaexampleswus2sa"
      + nfsv3_enabled                    = false
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = "jschmitter-gha-example-stage-wus2-rg"
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + shared_access_key_enabled        = true
      + tags                             = (known after apply)

      + blob_properties {
          + change_feed_enabled      = (known after apply)
          + default_service_version  = (known after apply)
          + last_access_time_enabled = (known after apply)
          + versioning_enabled       = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

Plan: 9 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
</details>

*Pusher: @joshschmitter, Action: `pull_request`*